import { extractPlainText } from './doc';
import { readFileSync } from 'fs';
import { resolve } from 'path';

const text = readFileSync(resolve(__dirname, '../../mock/txt.txt'), 'utf-8');

describe('extractPlainText ', () => {
  it('should split string by enter', async () => {
    const result = await extractPlainText(text, 1);
    expect(result).toEqual([
      '要花族单并毛养个根律京军，完快行转求极板不指芹。 条么素们七由再解做里音，准展那得月A体何本。 关命你南也色的容但果，农省斗见千义常飞称，战好刷到石到真辰。',
      '体布命持家劳出快物义，验看性声容取受，细目H奋抓M包团。 中极车料高除即直也六，想增自形便整务带争率，各命豆明板团道M。 见两西世备专点起口子，进时记理自际亲应但导，周叫M认质思指罐。 物必各起代在员叫合，并来效保济变海，节众否枣明极。',
      '改为部况近料低区矿员形，布提要则高装个都根质，各常极建串何活不真。 一为率是近市到育，际二斗地响习，不励壳杏己前。 族更更其格上决查速，权件现该争于。',
      '但阶价万内数器置适，情族往们拉界张，养事权决教行现B，芦经照心般后。 存干半六例究火分，实个门用世备无，率P束代指术。 一于从千所制，当辰1。',
    ]);
  });
  it('should split string by period', async () => {
    const result = await extractPlainText(text, 2);
    expect(result).toEqual([
      '要花族单并毛养个根律京军，完快行转求极板不指芹',
      '条么素们七由再解做里音，准展那得月A体何本',
      '关命你南也色的容但果，农省斗见千义常飞称，战好刷到石到真辰',
      '体布命持家劳出快物义，验看性声容取受，细目H奋抓M包团',
      '中极车料高除即直也六，想增自形便整务带争率，各命豆明板团道M',
      '见两西世备专点起口子，进时记理自际亲应但导，周叫M认质思指罐',
      '物必各起代在员叫合，并来效保济变海，节众否枣明极',
      '改为部况近料低区矿员形，布提要则高装个都根质，各常极建串何活不真',
      '一为率是近市到育，际二斗地响习，不励壳杏己前',
      '族更更其格上决查速，权件现该争于',
      '但阶价万内数器置适，情族往们拉界张，养事权决教行现B，芦经照心般后',
      '存干半六例究火分，实个门用世备无，率P束代指术',
      '一于从千所制，当辰1',
    ]);
  });
  it('should split string by comma', async () => {
    const result = await extractPlainText(text, 3);
    expect(result).toEqual([
      '要花族单并毛养个根律京军',
      '完快行转求极板不指芹。 条么素们七由再解做里音',
      '准展那得月A体何本。 关命你南也色的容但果',
      '农省斗见千义常飞称',
      '战好刷到石到真辰',
      '体布命持家劳出快物义',
      '验看性声容取受',
      '细目H奋抓M包团。 中极车料高除即直也六',
      '想增自形便整务带争率',
      '各命豆明板团道M。 见两西世备专点起口子',
      '进时记理自际亲应但导',
      '周叫M认质思指罐。 物必各起代在员叫合',
      '并来效保济变海',
      '节众否枣明极',
      '改为部况近料低区矿员形',
      '布提要则高装个都根质',
      '各常极建串何活不真。 一为率是近市到育',
      '际二斗地响习',
      '不励壳杏己前。 族更更其格上决查速',
      '权件现该争于',
      '但阶价万内数器置适',
      '情族往们拉界张',
      '养事权决教行现B',
      '芦经照心般后。 存干半六例究火分',
      '实个门用世备无',
      '率P束代指术。 一于从千所制',
      '当辰1',
    ]);
  });
});
